class AppStrings {
  static const noRouteFound = "No Route Found";
  static const onBoardingTitle1 = "SEE THE BEST ";
  static const onBoardingTitle2 = "SEE THE BEST ";
  static const onBoardingTitle3 = "SEE THE BEST ";
  static const onBoardingTitle4 = "SEE THE BEST ";

  static const onBoardingSubTitle1 =
      "تأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين.تأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقي السودانيين وكوكبة من رجال الأعمال المرموقينتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقيتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقيتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقيتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقيتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقي.";

  static const onBoardingSubTitle2 =
      "تأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين.تأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقي السودانيين وكوكبة من رجال الأعمال المرموقينتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقيتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقيتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقيتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقيتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقي.";

  static const onBoardingSubTitle3 =
      "تأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين.تأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقي السودانيين وكوكبة من رجال الأعمال المرموقينتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقيتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقيتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقيتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقيتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقي.";

  static const onBoardingSubTitle4 =
      "تأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين.تأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقي السودانيين وكوكبة من رجال الأعمال المرموقينتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقيتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقيتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقيتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقيتأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانىوقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقي.";

  static const skip = "Skip";

  static const password = "Password";
  static const usernameError = "Please enter your userName";
  static const passwordError = "Please enter your password";
  static const login = "Login";
  static const forgetPassword = "Forget password";
  static const registerText = "Not a member ? Sign up";
  static const loading = "Loading...";
  static const retryAgain = "Retry again";
  static const ok = "Ok";
  static const String success = "Success";
  static const String emailHint = 'Email';
  static const String invalidEmail = "Invalid Email";
  static const String resetPassword = "Reset Password";
  static const appName = "النيلين للتأمين";
  static const appNameEn = "Elnilein Insurance";
  static const empty = "";
  static const noInternetConnection = "الرجاء التحقق من الأتصال بالانترنت للمتابعة";



  ///Main View Strings
  static const homeTitle = "دليل الشبكة الطبية للعاصمة و الولايات";
  static const onboarding = "onboarding";
  static const companyName = "النيلين للتأمين";
  static const welcome = "مرحبا بك";
  static const bt0 = "من نحن";
  static const bt1 = "اختر موقعك";
  static const bt2 = "فروعنا";
  static const bt3 = "منتجاتنا";

  static const bt4 = "تواصل معنا";
  static const floatingActionButtonText = 'تحميل الشبكةالطبية';
  

  ///About Us Strings
  static const aboutUsTitle = "من نحن";
  static const aboutUsBodyText1 =
      "تأسست شركة النيلين للتأمين المحدودة فى العام 1981م برأس مال سودانى بريطانى بنسبة مساهماتقدرها 60% للمكون المحلى و 40% للمكون البريطانى وقد قام بتأسيسها المرحوم مأمون بحيرى الإقتصادى السوداني المعروف بمعية نخبة من الإقتصاديين السودانيين وكوكبة من رجال الأعمال المرموقين.";

  static const aboutUsBodyText2 =
      "وبموجب هذه الشراكة وضع أساسها الفنى خبراء بريطانيون ظلوا على قمة الجهاز الفنى لمدة سبعة سنوات. ظلت شركة النيلين للتأمين منذ تأسيسها وحتى الآن تقدم خدماتها لعملائها بصورة مرضية نالت إستحسان كل من تعامل معها طيلة هذه الفترة.";

  ///Contact Us Strings
  static const contactUsAppBarTitle = "تواصل معنا";
  static const contactUsTitle = "نستقبل جميع استفساراتكم في اي وقت";
  static const nameTFFText =  'الاسم';
  static const emailTFFText =  "البريد الألكتروني";
  static const phoneTFFText =  'رقم الهاتف';
  static const commentTFFText =  'التعليق/الأستفسار';
  static const submitBTText =  'ارسال';
  static const sendSuccessfuly =  'تم الارسال بنجاح';

  ///Our Branch Strings
  static const ourBranchAppBarTitle = "فروعنا";
  

  ///Our Products Strings
  static const ourProductsAppBarTitle = "منتجاتنا";
  static const openOnMap = "عرض على\nالخريطة";

  ///Choose Location Strings
  static const chooseLocationAppBarTitle = "اختر الولاية";
  static const choosecityAppBarTitle = "اختر المدينة";
  static const chooseMedicalNetworkAppBarTitle = "الشبكة الطبية";


}
